public_html/articles/other/sbcl-install.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Установка</a></li>
<li><a href="#unnumbered-2">Настройка</a></li>
</ul>
</div>
</div>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Установка</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
SBCL - Это Steel Bank Common Lisp, наиболее продвинутая в техническом отношении реализация
Common Lisp. А Common Lisp - наиболее продвинутый в техническом отношении язык
программирования. Поэтому без него мы не обойдемся. Также для интеграции с Емаксом нам
подадобиться SLIME и SWANK - эти компоненты связывают EMACS и SBCL воедино
</p>

<p>
&lt;source lang="bash"&gt;
$ sudo apt-get install sbcl slime cl-swank
&lt;/source&gt;
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Настройка</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
На самом деле для серьезного программирования на лиспе лучше все эти вещи ставить сильно
вручную, в зависимости от ваших задач, но для старта подойдет и упрощенный вариант. Вот что мы
прописываем в init.el:
</p>

<p>
&lt;source lang="lisp"&gt;
;;SBCL
(setq slime-lisp-implementations '((sbcl ("sbcl"))))
(setq slime-startup-animation nil)
;; Путь к локльной копии Common Lisp Hyper Specifications.
;; Если его не задавать - справка по функциям будет загружать страницы из интернета
;; (setq common-lisp-hyperspec-root "<a href="file:///Users/lisp/HyperSpec">file:///Users/lisp/HyperSpec</a>")
</p>

<p>
;; SLIME
(add-to-list 'load-path "~/.emacs.d/slime") ;; Путь к slime
(require 'slime)
(setq slime-net-coding-system 'utf-8-unix)
(slime-setup '(slime-fancy))
&lt;/source&gt;
</p>
</div>
</heading>
